app/controllers/comments_controller.rb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 295], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "parent_id", "user_id", "micropost_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "dfsd"], ["parent_id", nil], ["user_id", 1], ["micropost_id", 295], ["created_at", "2022-04-06 03:48:16.975975"], ["updated_at", "2022-04-06 03:48:16.975975"]]
---
  def create
    # render json: params
    @micropost = Micropost.find(params[:micropost_id])
    @comment = @micropost.comments.create(comment_params)

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 295], ["LIMIT", 1]]
---
  def new
    @micropost = Micropost.find(params[:micropost_id])