app/controllers/microposts_controller.rb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 295], ["LIMIT", 1]]
---
    def show
        if logged_in?
            @micropost = Micropost.find(params[:id])