app/models/user.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 1], ["followed_id", 3], ["created_at", "2022-04-06 03:47:48.504867"], ["updated_at", "2022-04-06 03:47:48.504867"]]
---
    def follow(other_user)
        active_relationships.create(followed_id: other_user.id)